Revit 2024 API
ITemporaryGraphicsHandler.OnClick Method
 Handles mouse click event on a given temporary graphics object managed by TemporaryGraphicsManager.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
void OnClick(
	TemporaryGraphicsCommandData data
)
Visual Basic
Sub OnClick ( _
	data As TemporaryGraphicsCommandData _
)
Visual C++
void OnClick(
	TemporaryGraphicsCommandData^ data
)
Parameters
data
Type: Autodesk.Revit.UI.TemporaryGraphicsCommandData
 The context data of the click event.
See Also
ITemporaryGraphicsHandler Interface
Autodesk.Revit.UI Namespace